// ============================================================================
// Назва: Student Data Entry
// Опис: Базова програма для введення та обробки даних студента.
// Демонструє роботу з макросами, базовими типами даних та консольним I/O.
// ============================================================================
#include <stdio.h>// Стандартна бібліотека вводу-виводу (printf, scanf)
#include <stdlib.h>// Стандартна бібліотека загального призначення (system)

// --- Макровизначення (Константи препроцесора) ---
#define Name "Mykola"
#define LastName "Ivanenko"
#define GroupName "GP-13"
#define Faculty "FFF"
#define University "Igor Sikorsky Kyiv Polytechnic Institute"
// ============================================================================
/*Функція main точка входу (Сигнатура, Тіло, Повернення значення)
Сигнатура (int main()): Це точка входу в програму.
Слово int означає тип даних, який функція поверне операційній
системі після завершення роботи. Порожні дужки () означають,
що функція не приймає аргументів із командного рядка.

Тіло функції ({ ... }): Увесь код,
укладений між фігурними дужками, є набором інструкцій,
які виконуються послідовно.

Повернення значення (return 0;):
Сигнал операційній системі про те,
що програма завершилась успішно, без помилок.
Будь-яке число відмінне від нуля означало б код системної помилки.*/
// ============================================================================

int main()
{
   // 1. Оголошення змінних (без знаку - лише додатні значення)
    unsigned int semestr;
    unsigned int age;

    // 2. Оголошення змінних (зі знаком - можуть бути від'ємними, хоча тут це не очікується)
    int grade1;
    int grade2;
    int grade3;

    // 3. Оголошення змінних з плаваючою комою (дробові числа)
    double averageGrade;
    float admissionScore;

    // 4. Виведення вітання з використанням макросів
    // %s очікує рядок (string). Передаємо Name та LastName.
    printf("%s %s Enter following data.\n", Name, LastName);

    // 5. Блок ініціалізації змінних користувачем
    printf("Enter semestr:");
    scanf("%u", &semestr);// %u - для unsigned int. & - передача адреси пам'яті змінної.
    printf("Enter your admission score: ");
    scanf("%f", &admissionScore);// %f - для float
    printf("Enter grade #1: ");
    scanf("%d", &grade1);// %d - для десяткового int
    printf("Enter grade #2:");
    scanf("%d", &grade2);
    printf("Enter grade #3:");
    scanf("%d", &grade3);
    printf("Enter your age: ");
    scanf("%u", &age);

    // 6. Обробка даних
    // Використовуємо явне приведення типів (double), щоб уникнути втрати дробової частини
    // при діленні цілих чисел.
    averageGrade = (double)(grade1 + grade2 + grade3) / 3;

    // 7. Очищення екрану терміналу
    // system() передає команду безпосередньо в оболонку ОС (тут - очищення екрану в Linux)
    system("clear");

    printf("%s", University);
    printf("\n%s", Faculty);

    // Успішне завершення програми
    return 0;
}
