// ============================================================================
// Назва: Student Data Entry
// Питання для самоперевірки:
// 1. Яка головна мета цієї програми?
// 2. Чому важливо дотримуватися саме такої структури (ініціалізація -> ввід -> обробка -> вивід)?
// ============================================================================
#include <stdio.h>// Питання: Які саме функції з цієї бібліотеки використовуються у програмі?
#include <stdlib.h>// Питання: Який рядок коду нижче перестав би працювати без підключення stdlib.h?

// --- Макровизначення ---
// Питання:
// 1. Чим макрос #define технічно відрізняється від оголошення змінної (наприклад, char name[] = "Mykola")?
// 2. Чи займають макроси місце в оперативній пам'яті під час виконання програми?
#define Name "Mykola"
#define LastName "Ivanenko"
#define GroupName "GP-13"
#define Faculty "FFF"
#define University "Igor Sikorsky Kyiv Polytechnic Institute"
// ============================================================================
// Питання: Чому головна функція має тип int, а дужки () залишені порожніми?
// Питання: Покажить курсором тіло функції.
// Питання: Скільки параметрів для даного прикладу приймає ця функція?
// Питання: Який тип даних вона повертає?
// ============================================================================

int main()
{
   // Питання:
    // 1. Що змінює unsigned перед int для змінної?
    // 2. Чому мова C вимагає обов'язково вказувати тип даних (наприклад, unsigned int) перед іменем змінної
    // 3. Що фізично відбувається в оперативній пам'яті комп'ютера у момент оголошення змінної?
    // 4. Як можна ініціалізувати ці змінні?
    // 5. Як офіційною термінологією мови C називається процес, що відбувається у цьому рядку (до етапу ініціалізації)
    unsigned int semestr;
    unsigned int age;

    // 2.1 Що станеться, якщо під час виконання програми користувач спробує ввести текст?
    // 2.2 Як офіційною термінологією мови C називається процес, що відбувається у цьому рядку?
    // 2.3 Як можна ініціалізувати ці змінні?
    int grade1;
    int grade2;
    int grade3;

    // 3.1 У чому фізична різниця виділення пам'яті між типами float та double?
    // 3.2 Як офіційною термінологією мови C називається процес, що відбувається у цьому рядку?
    // 3.3 Чому для середнього балу обрано саме double?
    // 3.4 Як можна ініціалізувати ці змінні?
    double averageGrade;
    float admissionScore;

    // 4.1 Який тип даних очікує специфікатор формату %s
    // 4.2 Опишить роботу функції на етапі виконання.
    // 4.3 Що виконує код на рядку нижче?(мова про синтаксис С)
    // 4.4 Як офіційною термінологією мови C називається процес, що відбувається у цьому рядку?
    printf("%s %s Enter following data.\n", Name, LastName);

    // 5.1 Чому у функції scanf перед назвою змінної обов'язково потрібно ставити символ амперсанда (&), а у printf — ні?
    // 5.5 Які помилки виникнуть, якщо переплутати специфікатори (наприклад, написати %d для змінної float)?
    // 5.3 Як офіційною термінологією мови C називається процес, що відбувається у рядках далі?
    printf("Enter semestr:");

    scanf("%u", &semestr);// %u - для unsigned int. & - передача адреси пам'яті змінної.
    printf("Enter your admission score: ");
    scanf("%f", &admissionScore);// %f - для float
    printf("Enter grade #1: ");
    scanf("%d", &grade1);// %d - для десяткового int
    printf("Enter grade #2:");
    // 1 Як офіційною термінологією мови C називається процес, що відбувається у рядку далі?
    // 2 Скільки параметрів приймає функція?
    // 3 Який тип параметру що приймає функція?
    scanf("%d", &grade2);
    printf("Enter grade #3:");
    scanf("%d", &grade3);
    printf("Enter your age: ");
    scanf("%u", &age);

    // 6.1 Що виконує цей рядок коду на етапі виконання програми?
    // 6.2 Як називається операція (double) перед дужками і для чого вона тут застосована?
    // 6.3 Яким був би результат математичного ділення (наприклад, 14 / 3), якби ми не використали цей оператор?
    averageGrade = (double)(grade1 + grade2 + grade3) / 3;

    // 7.1 Як офіційною термінологією мови C називається процес, що відбувається у рядку далі?
    // 7.2 Скільки параметрів приймає функція?
    // 7.3 Який тип параметру що приймає функція?
    system("clear");

    printf("%s", University);
    printf("\n%s", Faculty);

    // Успішне завершення програми
    return 0;
}
